In [76]:
import pandas as pd
import re
import json

with open ("C:\\Users\\prakasps\\Desktop\\Python\\abc.txt",'r') as file:
    d=file.read()

In [77]:
regex=re.compile(r'\w+: \w+{\w+=\S+')
print(regex.findall(d))
d1=regex.findall(d)

["abcd: abc{id='248-22-5548',", "xyz: abc{itemNumber='74-6-5311',", "xyz: abc{id='240-43-55',", "xyz: abc{id='240-43-3',", "xyz: abc{id='88-4-192',", "xyz: abc{id='65-12-141',", "xyz: abc{id='65-12-111',", "xyz: abc{id='53-0-2900',", "1234: abc{id='205-4-1277',", "1234: abc{id='205-4-1278',", "1234: abc{id='205-4-1279',", "1234: abc{id='205-4-1270',", "1234: abc{id='205-4-1271',", "1234: abc{id='205-4-1272',", "1234: abc{id='205-4-1273',", "1234: abc{id='205-4-1274',", "1234: abc{id='205-4-1275',", "1234: abc{id='205-4-1276',", "1234: abc{id='205-4-1280',", "1234: abc{id='205-4-1281',", "1234: abc{id='205-4-1282',", "1234: abc{id='205-4-1266',", "1234: abc{id='205-4-1267',", "1234: abc{id='205-4-1268',", "1234: abc{id='205-4-1269',", "1234: abc{id='205-4-1265',"]

In [78]:
for i in d1:
    print(i.split('-'))

["abcd: abc{id='248", '22', "5548',"]
["xyz: abc{itemNumber='74", '6', "5311',"]
["xyz: abc{id='240", '43', "55',"]
["xyz: abc{id='240", '43', "3',"]
["xyz: abc{id='88", '4', "192',"]
["xyz: abc{id='65", '12', "141',"]
["xyz: abc{id='65", '12', "111',"]
["xyz: abc{id='53", '0', "2900',"]
["1234: abc{id='205", '4', "1277',"]
["1234: abc{id='205", '4', "1278',"]
["1234: abc{id='205", '4', "1279',"]
["1234: abc{id='205", '4', "1270',"]
["1234: abc{id='205", '4', "1271',"]
["1234: abc{id='205", '4', "1272',"]
["1234: abc{id='205", '4', "1273',"]
["1234: abc{id='205", '4', "1274',"]
["1234: abc{id='205", '4', "1275',"]
["1234: abc{id='205", '4', "1276',"]
["1234: abc{id='205", '4', "1280',"]
["1234: abc{id='205", '4', "1281',"]
["1234: abc{id='205", '4', "1282',"]
["1234: abc{id='205", '4', "1266',"]
["1234: abc{id='205", '4', "1267',"]
["1234: abc{id='205", '4', "1268',"]
["1234: abc{id='205", '4', "1269',"]
["1234: abc{id='205", '4', "1265',"]

In [79]:
data_frame=pd.DataFrame(data=d1,index=None)

In [80]:
data_frame.columns=['data_set']

In [81]:
data_frame.head(5)

                           data_set
0       abcd: abc{id='248-22-5548',
1  xyz: abc{itemNumber='74-6-5311',
2          xyz: abc{id='240-43-55',
3           xyz: abc{id='240-43-3',
4           xyz: abc{id='88-4-192',

In [82]:
data_frame['id']=data_frame['data_set'].str.split(':')

In [83]:
data_frame[['T1','T2']]=data_frame['id'].apply(pd.Series)

In [84]:
data_frame.drop(['data_set','id'],axis=1)

      T1                            T2
0   abcd         abc{id='248-22-5548',
1    xyz   abc{itemNumber='74-6-5311',
2    xyz           abc{id='240-43-55',
3    xyz            abc{id='240-43-3',
4    xyz            abc{id='88-4-192',
5    xyz           abc{id='65-12-141',
6    xyz           abc{id='65-12-111',
7    xyz           abc{id='53-0-2900',
8   1234          abc{id='205-4-1277',
9   1234          abc{id='205-4-1278',
10  1234          abc{id='205-4-1279',
11  1234          abc{id='205-4-1270',
12  1234          abc{id='205-4-1271',
13  1234          abc{id='205-4-1272',
14  1234          abc{id='205-4-1273',
15  1234          abc{id='205-4-1274',
16  1234          abc{id='205-4-1275',
17  1234          abc{id='205-4-1276',
18  1234          abc{id='205-4-1280',
19  1234          abc{id='205-4-1281',
20  1234          abc{id='205-4-1282',
21  1234          abc{id='205-4-1266',
22  1234          abc{id='205-4-1267',
23  1234          abc{id='205-4-1268',
24  1234          abc{id='205-4-1269',
25  1234          abc{id='205-4-1265',

In [85]:
data_frame['T3']=data_frame['T2'].apply(pd.Series)

In [86]:
data_frame.drop(['data_set','id','T3'],axis=1,inplace=True)

In [87]:
data_frame['T3']=data_frame.T2.str.split('{').str[0]

In [88]:
data_frame['T4']=data_frame.T2.str.split('{').str[1]

In [89]:
data_frame['T5']=data_frame.T4.str.split('=').str[1]

In [90]:
data_frame['T6']=data_frame.T5.str.split('-').str[0]

In [91]:
data_frame['T7']=data_frame.T5.str.split('-').str[1]

In [92]:
data_frame['T8']=data_frame.T5.str.split('-').str[2]

In [93]:
data_frame.drop(['T2','T4','T5'],axis=1,inplace=True)

In [94]:
data_frame['T8']=data_frame['T8'].str.split("'").str[0]

In [95]:
data_frame['T6']=data_frame['T6'].str.split("'").str[1]

In [96]:
data_frame.head(5)

     T1    T3   T6  T7    T8
0  abcd   abc  248  22  5548
1   xyz   abc   74   6  5311
2   xyz   abc  240  43    55
3   xyz   abc  240  43     3
4   xyz   abc   88   4   192

In [97]:
df_concat=data_frame.groupby(['T6','T7'],as_index=False).agg(lambda x: ", ".join(sorted(set(x))))

In [98]:
df_concat

    T6  T7    T1    T3                                                 T8
0  205   4  1234   abc  1265, 1266, 1267, 1268, 1269, 1270, 1271, 1272...
1  240  43   xyz   abc                                              3, 55
2  248  22  abcd   abc                                               5548
3   53   0   xyz   abc                                               2900
4   65  12   xyz   abc                                           111, 141
5   74   6   xyz   abc                                               5311
6   88   4   xyz   abc                                                192

In [99]:
col_title=['T1','T3','T6','T7','T8']
df_concat=df_concat.reindex(columns=col_title)

In [100]:
df_concat['T6']=df_concat['T6'].astype(int)
df_concat['T7']=df_concat['T7'].astype(int)
df_concat['T8']=df_concat['T8'].apply(lambda x:"[{}]".format(x))

In [101]:
df_concat=df_concat.reset_index()

In [102]:
df_concat

,index,T1,T3,T6,T7,T8
0,0,1234,abc,205,4,"[1265, 1266, 1267, 1268, 1269, 1270, 1271, 127..."
1,1,xyz,abc,240,43,"[3, 55]"
2,2,abcd,abc,248,22,[5548]
3,3,xyz,abc,53,0,[2900]
4,4,xyz,abc,65,12,"[111, 141]"
5,5,xyz,abc,74,6,[5311]
6,6,xyz,abc,88,4,[192]

In [103]:
df_concat['ID']='ID'
df_concat['ITEM']='ITEM'

In [104]:
df_concat

,index,T1,T3,T6,T7,T8,ID,ITEM
0,0,1234,abc,205,4,"[1265, 1266, 1267, 1268, 1269, 1270, 1271, 127...",ID,ITEM
1,1,xyz,abc,240,43,"[3, 55]",ID,ITEM
2,2,abcd,abc,248,22,[5548],ID,ITEM
3,3,xyz,abc,53,0,[2900],ID,ITEM
4,4,xyz,abc,65,12,"[111, 141]",ID,ITEM
5,5,xyz,abc,74,6,[5311],ID,ITEM
6,6,xyz,abc,88,4,[192],ID,ITEM

In [105]:
col_title=['T1','T3','T6','ID','T7','ITEM','T8']
df_concat=df_concat.reindex(columns=col_title)

In [106]:
df_concat

,T1,T3,T6,ID,T7,ITEM,T8
0,1234,abc,205,ID,4,ITEM,"[1265, 1266, 1267, 1268, 1269, 1270, 1271, 127..."
1,xyz,abc,240,ID,43,ITEM,"[3, 55]"
2,abcd,abc,248,ID,22,ITEM,[5548]
3,xyz,abc,53,ID,0,ITEM,[2900]
4,xyz,abc,65,ID,12,ITEM,"[111, 141]"
5,xyz,abc,74,ID,6,ITEM,[5311]
6,xyz,abc,88,ID,4,ITEM,[192]

In [107]:
# this is one way but have to remove the 0,1,2,3,4,5,6
m={}
n=0
k=df_concat.shape
num=k[0]
while n < num:
    m[n]={df_concat['T1'][n]:{df_concat['T3'][n]:df_concat['T6'][n],df_concat['ID'][n]:df_concat['T7'][n],df_concat['ITEM'][n]:df_concat['T8'][n]}}
    n=n+1
print(m)

{0: {'1234': {' abc': 205, 'ID': 4, 'ITEM': '[1265, 1266, 1267, 1268, 1269, 1270, 1271, 1272, 1273, 1274, 1275, 1276, 1277, 1278, 1279, 1280, 1281, 1282]'}}, 1: {'xyz': {' abc': 240, 'ID': 43, 'ITEM': '[3, 55]'}}, 2: {'abcd': {' abc': 248, 'ID': 22, 'ITEM': '[5548]'}}, 3: {'xyz': {' abc': 53, 'ID': 0, 'ITEM': '[2900]'}}, 4: {'xyz': {' abc': 65, 'ID': 12, 'ITEM': '[111, 141]'}}, 5: {'xyz': {' abc': 74, 'ID': 6, 'ITEM': '[5311]'}}, 6: {'xyz': {' abc': 88, 'ID': 4, 'ITEM': '[192]'}}}

In [108]:
# this is another way
d={}
for i in df_concat['T1'].unique():
    d[i]=[{df_concat['T3'][n]:df_concat['T6'][n],df_concat['ID'][n]:df_concat['T7'][n],df_concat['ITEM'][n]:df_concat['T8'][n]} for n in df_concat[df_concat['T1']==i].index]

In [109]:
d

{'1234': [{' abc': 205,
   'ID': 4,
   'ITEM': '[1265, 1266, 1267, 1268, 1269, 1270, 1271, 1272, 1273, 1274, 1275, 1276, 1277, 1278, 1279, 1280, 1281, 1282]'}],
 'xyz': [{' abc': 240, 'ID': 43, 'ITEM': '[3, 55]'},
  {' abc': 53, 'ID': 0, 'ITEM': '[2900]'},
  {' abc': 65, 'ID': 12, 'ITEM': '[111, 141]'},
  {' abc': 74, 'ID': 6, 'ITEM': '[5311]'},
  {' abc': 88, 'ID': 4, 'ITEM': '[192]'}],
 'abcd': [{' abc': 248, 'ID': 22, 'ITEM': '[5548]'}]}

In [115]:
for key,value in d.items():
    print("\n{} is {}.\n".format(key,value))
    print("+++++++++++++++++++")

1234 is [{' abc': 205, 'ID': 4, 'ITEM': '[1265, 1266, 1267, 1268, 1269, 1270, 1271, 1272, 1273, 1274, 1275, 1276, 1277, 1278, 1279, 1280, 1281, 1282]'}].

+++++++++++++++++++

xyz is [{' abc': 240, 'ID': 43, 'ITEM': '[3, 55]'}, {' abc': 53, 'ID': 0, 'ITEM': '[2900]'}, {' abc': 65, 'ID': 12, 'ITEM': '[111, 141]'}, {' abc': 74, 'ID': 6, 'ITEM': '[5311]'}, {' abc': 88, 'ID': 4, 'ITEM': '[192]'}].

+++++++++++++++++++

abcd is [{' abc': 248, 'ID': 22, 'ITEM': '[5548]'}].

+++++++++++++++++++